# 테스트 1
# 입력값 〉	[[3, 2], [6, 4], [4, 7], [1, 4]], [[4, 2], [1, 3], [2, 4]]
# 기댓값 〉	1
# 실행 결과 〉	
# 테스트 2
# 입력값 〉	[[3, 2], [6, 4], [4, 7], [1, 4]], [[4, 2], [1, 3], [4, 2], [4, 3]]
# 기댓값 〉	9
# 실행 결과 〉	실행한 결괏값 13이 기댓값 9과 다릅니다.
# 출력 〉	[[[0, 3, True], [1, 3, True], [2, 3, True], [3, 3, True], [4, 3, True], [5, 3, True], [5, 3, False], [5, 3, False]], 
#           [[2, 1, True], [3, 1, True], [3, 2, True], [3, 3, True], [3, 4, True], [3, 5, True], [3, 6, True], [3, 6, False]], 
#           [[0, 3, True], [1, 3, True], [2, 3, True], [3, 3, True], [4, 3, True], [5, 3, True], [5, 3, False], [5, 3, False]], 
#           [[0, 3, True], [1, 3, True], [2, 3, True], [3, 3, True], [3, 4, True], [3, 5, True], [3, 6, True], [3, 6, False]]]
# 테스트 3
# 입력값 〉	[[2, 2], [2, 3], [2, 7], [6, 6], [5, 2]], [[2, 3, 4, 5], [1, 3, 4, 5]]
# 기댓값 〉	0
# 실행 결과 〉